//=============================================================================
//
// スコア処理 [score.h]
// Author : 
//
//=============================================================================
#pragma once


//*****************************************************************************
// マクロ定義
//*****************************************************************************

typedef struct _SCORE {
	int			score;		//	表示したい数値
	XMFLOAT3	pos;		//	位置
	float		width;		//	幅
	float		height;		//	縦
	bool		use;		//	使用されているかどうか
	int			digit;		//	数値の桁
}SCORE;

enum SCORE_TYPE
{
	SCORE_CUR_MAGAZINE,
	SCORE_SUB_MAGAZINE,
	SCORE_TYPE_MAX
};
//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitScore(void);
void UninitScore(void);
void UpdateScore(void);
void DrawScore(void);



